# name:shen
# time:2023/3/1
# content:

## 1.匿名函数与map方法

> 类似于函数的精简写法：

In [3]:
my_func = lambda x : 2*x
my_func(2)

4

In [4]:
Num_caculate = lambda x,y,z :x%y+z
Num_caculate(2,4,6)

8

In [5]:
# 匿名函数
[(lambda x : 2*x)(i) for i in range(5)]

[0, 2, 4, 6, 8]

In [6]:
# map函数
list(map(lambda x : 2*x,range(5)))

[0, 2, 4, 6, 8]

In [7]:
# 练习：
name = ['小明','小红','李华']
age = [18,19,17]

In [9]:
list(map(lambda x,y:x+'_'+str(y),name,age))

['小明_18', '小红_19', '李华_17']

# 2.zip对象和enumerate方法

In [15]:
# zip方法

G1,G2,G3 = list("abc"),list("def"),list("ghi")
list(zip(G1,G2,G3))

[('a', 'd', 'g'), ('b', 'e', 'h'), ('c', 'f', 'i')]

In [16]:
G1

['a', 'b', 'c']

In [14]:
tuple(zip(G1,G2,G3))

(('a', 'd', 'g'), ('b', 'e', 'h'), ('c', 'f', 'i'))

In [17]:
# enumerate 方法

# 3.文件读取和写入

In [2]:
import pandas as pd

In [3]:
df_csv = pd.read_csv('./my_csv.csv')

In [4]:
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [5]:
pd.read_table("./my_table.txt")

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

In [6]:
# header=None 表示第一行不作为列名
pd.read_table("./my_table.txt",header=None)

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

In [10]:
pd.read_table("./my_table_special_sep.txt",sep="\|\|\|\|")

C:\Users\17728\AppData\Local\Temp\ipykernel_10956\3971045828.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  pd.read_table("E:\大二第二学期\data_analysis-master (1)\data\my_table_special_sep.txt",sep="\|\|\|\|")

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!
3   PT      May I help you?

In [12]:
pd.read_table("./my_table_special_sep.txt",sep=" ")

               col1  ||||    col2
TS |||| This     is    an  apple.
GQ |||| My     name    is    Bob.
WT |||| Well  done!   NaN     NaN
PT |||| May       I  help    you?

In [14]:
pd.read_table("./my_table_special_sep.txt",sep=" ",engine="python")

               col1  ||||    col2
TS |||| This     is    an  apple.
GQ |||| My     name    is    Bob.
WT |||| Well  done!  None    None
PT |||| May       I  help    you?

In [16]:
pd.read_table("./my_table_special_sep2.txt",sep="，",engine="python")

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!
3   PT      May I help you?

In [7]:
pd.read_csv('./my_csv.csv', index_col=['col1', 'col2'])

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5
5    d      3.2   lemon  2020/1/7

In [8]:
pd.read_csv('./my_csv.csv', usecols=['col1', 'col2'])  #仅仅使用这两列

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

In [18]:
dbdd=pd.read_html('https://hurun.net/zh-CN/Info/Detail?num=L9SQPH9FKJB1')[0]

In [19]:
dbdd.to_excel("outputhurun.xlsx",index=False) # index=False可以去掉第一列

In [20]:
dbdd.to_csv("outputhurun.csv",index=False,encoding='UTF-8')

In [21]:
dbdd.to_csv("outputhurun.txt",sep='\t')

In [22]:
dbdd.to_markdown("hurun.md")
dbdd

     0     1             2          3            4    5     6     7
0   排名  排名变化            企业  价值（亿元人民币）  价值变化（亿元人民币）   总部    行业  成立年份
1    1     0            抖音      13400       -10050   北京  社交媒体  2012
2    2     1        SpaceX       8400         1680  洛杉矶    航天  2002
3    3    -1          蚂蚁集团       8000        -2010   杭州  金融科技  2014
4    4     0        Stripe       4100        -2230  旧金山  金融科技  2010
5    5    11         Shein       4000         2680   广州  电子商务  2012
6    6    15            币安       3000         2010  马耳他   区块链  2017
7    7     1    Databricks       2500            0  旧金山   大数据  2013
8    8     3          微众银行       2200          200   深圳  金融科技  2014
9    9     2          京东科技       2000            0   北京  数字科技  2013
10  10    11  Checkout.com       1900          870   伦敦  金融科技  2012